---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowConfigurationName
source: html/06ac2669-6eb0-6a90-b5e4-dd509bfe9c50.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowConfigurationName Property

If true legend contains analysis configuration name.

## Syntax (C#)
```csharp
public bool LegendShowConfigurationName { get; set; }
```